// const main = JSON.parse(api.read('main.json'));
// await api.writeCSV('main.csv', main, [
//   '專案號碼',
//   '請購日期',
//   '請購單號',
//   '供應廠商',
//   '採購人員',
//   '採購量',
//   '未稅單價',
//   '含稅單價',
//   '上傳文件名稱',
//   '採購單號',
//   '處理情況(確認碼/狀況碼)',
//   '付款條件',
//   '內部備註欄',
//   '原始到廠日期',
//   '原始交貨日期',
//   '原始到貨日期',
//   'apmp200',
//   'apmt540',
// ]);

// const finish = JSON.parse(api.read('finish.json'));
// await api.writeCSV(
//   `finish_${moment(new Date()).format('YYMMDD')}.csv`,
//   finish,
//   [
//     '專案號碼',
//     '請購日期',
//     '請購單號',
//     '供應廠商',
//     '採購人員',
//     '採購量',
//     '未稅單價',
//     '含稅單價',
//     '上傳文件名稱',
//     '採購單號',
//     '處理情況(確認碼/狀況碼)',
//     '付款條件',
//     '內部備註欄',
//     '原始到廠日期',
//     '原始交貨日期',
//     '原始到貨日期',
//     'apmp200',
//     'apmt540',
//   ]
// );
